{
	### NOTE: you have to restart the game in order for any changes to these settings to take effect

	"GachaSMods_trueRandomMode": false,
	# Boolean. Default `false`.
	# If true, will roll (almost) any hullmod.
	## Note: This supercedes the noSaveScumming and onlyXHullmods settings and is equivalent to setting them to false.

	"GachaSMods_noSaveScumming": true,
	# Boolean. Default `true`.
	# If true, ships will roll the same s-mods and bonus xp every time. Unless the in-game re-roll mechanic has been used.

	"GachaSMods_onlyKnownHullmods": false,
	# Boolean. Default `false`.
	# If true, will only roll hullmods known by the player.
	
	"GachaSMods_onlyNotHiddenHullmods": true,
	# Boolean. Default `true`.
	# If true, will only roll not-hidden hullmods (i.e. modular/learnable hullmods)
	
	"GachaSMods_onlyApplicableHullmods": true,
	# Boolean. Default `true`.
	# If true, will only roll hullmods that are applicable on the ship (so no Safety Overrides for capital ships).
	# May have strange results with hidden hullmods.

	"GachaSMods_disableRandomSMods": false,
	# Boolean. Default `false`.
	# If true, hides the Random S-Mod hullmod and allows regular s-modding.
	## Note: This supercedes the allowStandardSMods setting and is equivalent to setting it to true. (fun as it would be to block s-modding entirely :V)
	
	"GachaSMods_disableRemoveSMods": false,
	# Boolean. Default `false`.
	# If true, hides the Remove S-Mod hullmod. TBH, the intended experience for the mod.

	"GachaSMods_allowStandardSMods": false,
	# Boolean. Default `false`.
	# If true, allows regular s-modding but does not affect the two hullmods added by the mod
	# Thus allows both randomized s-mods and standard s-modding, and removing s-mods (under default settings).

	"GachaSMods_minRemovedSMods": 1,
	# Integer. Default `1`. Min 0. Max 10.
	# Sets the minimum number of s-mods that can be randomly removed whenever Remove S-Mods is built in. Set it to 0 or you're a coward.
	# Be gentle (uwu), I tried to catch every conceivable way you could break this but I might not have gotten everything.

	"GachaSMods_maxRemovedSMods": 3,
	# Integer. Default `3`. Min 0. Max 10.
	# Sets the maximum number of s-mods that can be randomly removed whenever Remove S-Mods is built in.
	# Hard limit of 10 or else something will break.
	# If it's less than minRemovedSMods, it'll be set equal to the min and I'll be mad at you >:(
}