{
	### NOTE: you have to restart the game in order for any changes to these settings to take effect
	
	#######################
###### v important stuff ##
	#######################
	#"maxPermanentHullmods":2,
	# Integer. Default `2`.
	# This is a vanilla setting, commented out here for easy accessibility.

	"GachaSMods_noSaveScumming": true,
	# Boolean. Default `true`.
	# If true, ships will roll the same s-mods and bonus xp every time until you've confirmed your choice.

	"GachaSMods_useOnlineBlacklist": false,
	# Boolean. Default `false`. BUT RECOMMENDED TO BE `true`.
	# If true, will also check the latest blacklist from the GitHub source:
	# https://raw.githubusercontent.com/RustyCabbage/GachaSMods/main/data/config/settings.json
	# Hence it would no longer be necessary to redownload the mod for blacklist updates.

	#############################
###### disable/enable features ##
	#############################
	"GachaSMods_disableRandomSMods": false,
	# Boolean. Default `false`.
	# If true, hides the Random S-Mod hullmod and allows regular s-modding.
	## Note: This supercedes the allowStandardSMods setting and is equivalent to setting it to true (fun as it would be to block s-modding entirely :V).
	## Warning: doesn't work with versions of Ship Catalogue / Variant Editor (SCVE) before v1.6.0. Oops.
	
	"GachaSMods_disableRemoveSMods": false,
	# Boolean. Default `false`.
	# If true, hides the Remove S-Mod hullmod. TBH, the intended experience for the mod.
	## Warning: doesn't work with versions of Ship Catalogue / Variant Editor (SCVE) before v1.6.0. Oops.

	"GachaSMods_allowStandardSMods": false,
	# Boolean. Default `false`.
	# If true, allows regular s-modding but does not affect the two hullmods added by the mod.
	# Thus allows both randomized s-mods and standard s-modding, and removing s-mods (under default settings).

	##########################
###### random s-mod options ##
	##########################
	"GachaSMods_selectionMode": "CL",
	# String. Default `CL`.
	###  MODES: 
	# `CL`: Classic - Hullmods are selected with uniform probability of selection.
	# `PR`: Proportional - Hullmods are selected with weight = 1/OP, with an adjustable increase for free/hidden hullmods.
	# `TG`: True Gacha - Hullmods are split into 4 categories (d-mods, cheap mods, standard mods, hidden mods), with each category being allocated an adjustable weight.
	###
	# Must be spelt correctly, or you're stuck with Classic mode.
	# You can adjust the Proportional and True Gacha settings further down under 'selection mode options'

	"GachaSMods_trueRandomMode": false,
	# Boolean. Default `false`.
	# If true, it will be possible to roll (almost) any hullmod. Weights will still follow the selection mode chosen above.
	## Note: This supercedes the noSaveScumming, onlyXHullmods, and respectNoBuildIn settings and is equivalent to setting them to false.

	"GachaSMods_onlyKnownHullmods": false,
	# Boolean. Default `false`.
	# If true, will only roll hullmods known by the player.
	
	"GachaSMods_onlyNotHiddenHullmods": true,
	# Boolean. Default `true`.
	# If true, will only roll not-hidden hullmods (i.e. modular/learnable hullmods).
	# If false, you can roll any hidden mod, including d-mods.
	
	"GachaSMods_onlyApplicableHullmods": true,
	# Boolean. Default `true`.
	# If true, will only roll hullmods that are applicable on the ship (so no Safety Overrides for capital ships).
	# May have strange results with hidden hullmods.

	"GachaSMods_respectNoBuildIn": true,
	# Boolean. Default `true`.
	# If true, will not roll hullmods that have the no_build_in tag (e.g. Safety Overrides).

	"GachaSMods_blacklistedHullmods":[
		"vastbulk",								# breaks AI and is boring
		"cataphractBonus",						# (ArmA) java.lang.NullPointerException on mouseover
		"variawep",								# (ArmA) I don't know what the heck this does, but it broke everything lmao
		"apex_variable_warheads",				# java.lang.RuntimeException upon battle entry if the ship doesn't have a WS0015 and WS0016 weapon slot
		"apex_spectrum_cargo",					# java.lang.RuntimeException if rolled on a not apex_spectrum ship
		"apex_spectrum_fuel",					# java.lang.RuntimeException if rolled on a not apex_spectrum ship
		"ae_fluxgenerator",						# I could not reproduce this but I'm told that it can cause crashes. Disable at your own risk.
		"diableavionics_virtuousMasterHullmod", # java.lang.NullPointerException
		"gg_lg_fighter",						# (Fighter Expansion Rebalanced) java.util.UnknownFormatConversionException on mouseover
		"gg_xiv_fighter",						# (Fighter Expansion Rebalanced) java.util.UnknownFormatConversionException on mouseover
		"loa_ship_factory",						# java.lang.RuntimeException if not on the Anageraisieieamfafgeneisis ship
		"SKR_siegfriedLoadout",					# java.lang.StringIndexOutOfBoundsException (gotta confirm but I don't have latest Seeker
		"sw_reflective_shield",					# CTDs with Shield Shunt

		# Requested by Mayu:
		"bbplus_sm_unstable",
		"bbplus_sm_highgrade",
		"bbplus_sm_lowgrade",
		"bbplus_sm_unstable_dummy",
		"bbplus_sm_highgrade_dummy",
		"bbplus_sm_lowgrade_dummy",
		"bbplus_fluxdischarger",
		"bbplus_mnemosyne_briar_hull",
	],
	# Tell me whenever you notice a modded hullmod that is either game breaking or causes crashes and I'll update the list.
	# Alternatively, as a mod author you can either add this same array "GachaSMods_blacklistedHullmods" to your mod
		# or send me a note with hullmods you'd like to blacklist and I'll update this list with your hullmods.

	"GachaSMods_useGreylist": false,
	# Boolean. Default `false`.
	# If true, will prevent loading any hullmods in greylistedHullmods.json
	# "greylistedHullmods.json" is a file with a list of hullmods others have suggested should be removed since they don't do anything but otherwise don't cause issues.
	# I'll provide and update that list if you have suggestions, but I won't be curating it (unlike with the blacklist), hence this setting is off by default.
	# If "GachaSMods_useOnlineBlacklist" is true, it will load the greylist from the GitHub source as well:
	# https://raw.githubusercontent.com/RustyCabbage/GachaSMods/main/data/config/greylistedHullmods.json

	############################
###### selection mode options ##
	############################
	"GachaSMods_PR_incrForFreeOrHiddenMods": 20,
	# Integer. Default `20`. Min `1`.
	# In Proportional mode, for free or hidden hullmods, this value is added to their OP cost (adjusted for size: (1/2/3/5x)) to determine their weight.
	# E.g. Flux Shunt on a capital ship has weight 1/(50+20*5) = 1/150 under default settings.

	"GachaSMods_TG_costForRare2": 3,
	# Integer. Default `3`.
	# In True Gacha mode, for a given non-dmod and non-hidden hullmod, if the OP cost < this value (adjusted for size: (1/2/3/5x)), it is placed in RARE2, else RARE3.

	"GachaSMods_TG_rare1Mult": 52.5,
	# Float. Default `52.5`.
	# Multiplier for d-mods. Under vanilla & default settings, each d-mod has a 2.5% chance of selection.

	"GachaSMods_TG_rare2Mult": 25,
	# Float. Default `25`.
	# Multiplier for cheap hullmods. Under vanilla & default settings, each cheap hullmod has a ~1.5% chance of selection.

	"GachaSMods_TG_rare3Mult": 15,
	# Float. Default `15`.
	# Multiplier for standard cost hullmods. Under vanilla & default settings, each standard hullmod has a ~0.5% chance of selection.

	"GachaSMods_TG_rare4Mult": 7.5,
	# Float. Default `7.5`.
	# Multiplier for hidden hullmods.
	# Under vanilla & default settings, from my count, there are 6 bad, 3 neutral, and 18 good hidden hullmods (may vary depending on e.g. phase ship status).
	# Hence, you have a 5% chance of getting a beneficial hullmod and a 1.67% chance of getting a bad hidden hullmod (each one has a 0.27% chance of selection).

	##########################
###### remove s-mod options ##
	##########################
	"GachaSMods_minRemovedSMods": 1,
	# Integer. Default `1`. Min `0`. Max `10`.
	# Sets the minimum number of s-mods that can be randomly removed whenever Remove S-Mods is built in (set it to 0, coward).
	# Be gentle (uwu), I tried to catch every conceivable way you could break this but I might not have gotten everything.

	"GachaSMods_maxRemovedSMods": 3,
	# Integer. Default `3`. Min `0`. Max `10`.
	# Sets the maximum number of s-mods that can be randomly removed whenever Remove S-Mods is built in.
	# Hard limit of 10 or else something will break.
	# If it's less than minRemovedSMods, it'll be set equal to the min and I'll be mad at you >:(
}
